[
    {
        "id": "73468169",
        "title": "Tkinter root.destroy delayed after time.sleep",
        "content": "After destroying a Tkinter window I put a time.sleep, however it first waits, then destroys the window, instead of first destroying then waitingroot.destroy()time.sleep(5)",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73468162",
        "title": "Is it possible to get the payload data of a JavaScript socket io and print it using Django?",
        "content": "I have this JavaScript project that uses socket io and console the data.const   = generateMockData(deviceId);        console.log(payload)        io.of(\"/\").emit(\"data\", JSON....",
        "vote": "0",
        "answer": "0",
        "view": "1"
    },
    {
        "id": "73468144",
        "title": "Can we predict features from labels in machine learning",
        "content": "Given a dataset with 100 observations and 3 features plus one label(regression). we train the model with 100 * 4(3 features + 1 label) data. Now can we predict the features when the label is given as ...",
        "vote": "-1",
        "answer": "-1",
        "view": "0"
    },
    {
        "id": "73468126",
        "title": "calculate mean of new list of number with old mean",
        "content": "I have a requirement to update the existing mean when new set of data is coming.For example,Say I have already calculated mean of a list of numbers and kept.from statistics import meanl1=[1,0,1,0,...",
        "vote": "0",
        "answer": "0",
        "view": "2"
    },
    {
        "id": "73468125",
        "title": "How do I go about incrementing a datetime value by one month using 'relativedelta(months=1)' without affecting the numerical day value?",
        "content": "enter image description hereThe code I wrote above works fine except I want the numerical day (%d) of the month to stay unchanged (30th) for all the months bar February (28th). The fact that the day ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73468111",
        "title": "Minor axis measurement in irregular shape object",
        "content": "The minor axis is the (x,y) endpoints of thelongest line that can be drawn through theobject whilst remaining perpendicular with themajor-axis.– The minor axis endpoints (x1,y1) and (x2,y2) are...",
        "vote": "0",
        "answer": "0",
        "view": "1"
    },
    {
        "id": "73468109",
        "title": "Search python by userinput & return corresponding values",
        "content": "I am trying to create a jira taskBot using telegram/AWS lambda/Python.I am new to python!Basically a user can message the telegram bot and assign a Jira task to another user by typing:/assigntask &...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73468098",
        "title": "How to use reverse proxy over websocket communication in Python?",
        "content": "I'm doing an IoT project with Python. In the project, I am having a problem while communicating with an internal network and a public network. Endpoint establishes a continuous connection with the ...",
        "vote": "-2",
        "answer": "-2",
        "view": "0"
    },
    {
        "id": "73468079",
        "title": "How can I make pairs of the partner_name values in the given dataset?",
        "content": "user_idpartner_nameorder_sequence\r2Star Bucks1\r2KFC2\r2MCD3\r6Coffee Store1\r6MCD2\r9KFC1\rI am trying to figure out what two restaurant combinations occur the most often. For instance,...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73468030",
        "title": "local variable 'orgHigh' referenced before assignment in google colab ( python 3.7 )",
        "content": "I'm having the local variable referenced before the assignment error and I have tried a lot of ways that I can use to fix this. Any help would be greatly appreciated.error;Traceback (most recent ...",
        "vote": "-1",
        "answer": "-1",
        "view": "1"
    },
    {
        "id": "73468031",
        "title": "How to put 1 or 2 in A column according to the value of column B?",
        "content": "For example, if house column is \"Own\" (it is string), than I want to put 1 to tax_home.How can I make code for it?I tried this code but it doesn't work.Help medef none(x):    if df1['...",
        "vote": "0",
        "answer": "0",
        "view": "3"
    },
    {
        "id": "73468019",
        "title": "Can't import .py files [closed]",
        "content": "I was trying to run the code from this repo: https://github.com/alexfrom0815/Online-3D-BPP-PCTand I ran into these errors:Traceback (most recent call last):  File \"C:\\Users\\thien\\Desktop\\test\\...",
        "vote": "-2",
        "answer": "-2",
        "view": "0"
    },
    {
        "id": "73468001",
        "title": "How to run where Query in postgres using python [closed]",
        "content": "I am trying to get data from database using python.but i am getting a error.and value is already exist in my databasecur.execute(\"SELECT * from home_curd WHERE consumer_type= domestic\")...",
        "vote": "-2",
        "answer": "-2",
        "view": "0"
    },
    {
        "id": "73467992",
        "title": "How to use PyMedTermino with MongoDB to map synonyms?",
        "content": "could anyone please guide me on how to use PyMedTermino with MongoDB?My aim is to map the diseases with it's synonyms (synonyms in an array) using the UMLS data and store the database in MongoDB.The ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467991",
        "title": "Debug python code loaded from program launched from terminal",
        "content": "I am launching a program remotely over ssh from a Makefile if that matters, that requires a special command line environment and parameter, that eventually runs python code via libpython.so. I am ...",
        "vote": "-4",
        "answer": "-4",
        "view": "0"
    },
    {
        "id": "73467983",
        "title": "Python how to add two maticies with different number of rows and columns?",
        "content": "Suppose I have two 2D matricies: [[1,2],[0,0]] and [[4,8],[0,0],[5,6]] and I want to sum them up and get the matrix [[5,10],[0,0],[5,6]]. How can I do it in the most easiest way without writing my own ...",
        "vote": "1",
        "answer": "1",
        "view": "1"
    },
    {
        "id": "73467970",
        "title": "i Want to Extract the Paragraph Below a specific word.docx and store it to a variable",
        "content": "Market InsightsThe global Military Gas Mask market was valued at US$ 5.51 Billion in 2021, and it is expected to reach a value of US$ 14.93 Billion by 2028, at a CAGR of 11.7% over the forecast ...",
        "vote": "-2",
        "answer": "-2",
        "view": "1"
    },
    {
        "id": "73467963",
        "title": "New to Python: How to keep the first letter of each word capitalized?",
        "content": "I was practicing with this tiny program with the hopes to capitalize the first letter of each word in: john Smith.I wanted to capitalize the j in john so I would have an end result of John Smith and ...",
        "vote": "0",
        "answer": "0",
        "view": "2"
    },
    {
        "id": "73467940",
        "title": "How can I implement multiple user accounts at the same time in discord.py",
        "content": "I'm trying to make it possible for several users to use the bot's capabilities independently of each other's incoming data, but when 2> users try to use their data from the database, they can edit ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467915",
        "title": "Given the quarter name return the start and end dates",
        "content": "I have a string like \"2015-Q1\". What is the best way to return the start date and end date of the given quarter?Input:2015-Q1Expected Output:(2015-01-01,2015-03-31)",
        "vote": "-1",
        "answer": "-1",
        "view": "4"
    },
    {
        "id": "73467902",
        "title": "Share attributes/ variables between classes python",
        "content": "class Base(object):    def __init__(self):        print(\"Base created\")        a = \"baseclass\"class ChildA(Base):    def __init__(self):        Base.__init__(self)        b ...",
        "vote": "-1",
        "answer": "-1",
        "view": "1"
    },
    {
        "id": "73467894",
        "title": "In Python, how can I append each key and value of dictionary to columns?",
        "content": "In Python, I have a dataframe that has json variablesFor example,If keys and values of a column are like{'a': 3, 'b': 2, 'c': 1}{'d': 287, 'e': 56, 'f': 17, 'g': 9}{'h': 22, 'i': 15, 'a': 7}{'g':...",
        "vote": "-1",
        "answer": "-1",
        "view": "1"
    },
    {
        "id": "73467892",
        "title": "Link prediction algorithm for signed networks",
        "content": "I am trying to find a link prediction algorithm for signed networks. I have about 17 signed networks with an average of 11 nodes and 50 edges. I am using networkx to analyze them and I am trying to ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467878",
        "title": "how to get component instance of angular app using selenium python",
        "content": "We are automating angular app using selenium webdriver python. And I was wondering if there is any way to reach to the component instances,Using this I guess we can verify the data which is rendered ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467873",
        "title": "Django formsets not saving all forms to the database",
        "content": "I have a formset to render multiple forms at once. By default only two forms are rendered.Using JavaScript, I'm adding another two forms to the formset, so the total number of forms is now four.When ...",
        "vote": "1",
        "answer": "1",
        "view": "1"
    },
    {
        "id": "73467872",
        "title": "ModuleError: No module named pptx found",
        "content": "I am writing a python code for merging ppts. It takes the location of the 2 ppts, merges them and puts the merged ppt formed in the folder given by user. The code used is:import sysfrom pptx import ...",
        "vote": "0",
        "answer": "0",
        "view": "1"
    },
    {
        "id": "73467861",
        "title": "How to pass variable as a parameter in SQL in python",
        "content": "Question: I want to use either variable x as a parameter for where condition in SQL query. Also, can I use data frame as a parameter for where condition in SQL in pythonQuery:x= ('610094437','...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467857",
        "title": "How can I write a code the output will be in one line? [closed]",
        "content": "this is my code's picturehow can I write all the informations in the same line? in python.",
        "vote": "-3",
        "answer": "-3",
        "view": "1"
    },
    {
        "id": "73467823",
        "title": "Is there any way to get email/whatsapp notification when a scheduled python file in task scheduler fails to execute?",
        "content": "I am currently working on scheduling some python tasks for different purposes, but I want to get notified about the failure of python code execution if it doesn't reach the end of line.I have ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467817",
        "title": "how to fix url in scrapy because my url is changed",
        "content": "class IronsSpider(scrapy.Spider):    name = 'irons'    allowed_domains = ['ironplanet.com.au']    start_urls = ['https://www.ironplanet.com.au/jsp/s/search.ips#pstart=0&sm=0&k=steel&mf=...",
        "vote": "-1",
        "answer": "-1",
        "view": "0"
    },
    {
        "id": "73467813",
        "title": "Mimic UDP DNS server Python application client/server",
        "content": "i'm looking to build a mimic UDP DNS cleint/server application in python that will essentially supoport A and CNAME, and translate the host name to ip address and host aliasing, with the client ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467812",
        "title": "Is there any way to implement early stopping callback for Tensorflow 2 model_main_tf.py?",
        "content": "Hello I'm working on object detection using tensorflow 2 object detection API model_main_tf2.py file normally we can use early stopping callback for model.fit() when we use normally but when i tried ...",
        "vote": "-1",
        "answer": "-1",
        "view": "0"
    },
    {
        "id": "73467803",
        "title": "How can I print the \"target\" form the below image",
        "content": "strong textcode-->>    for i in data_dict[\"design_state_data\"]:        print(i)output-->>      session_info      target      train      metrics      feature_handling   ...",
        "vote": "1",
        "answer": "1",
        "view": "1"
    },
    {
        "id": "73467799",
        "title": "How to change existing python script for Postgres Dump?",
        "content": "I have a python script that creates pg_dump file by Postgres DB, but here's the issue: this script takes only defined table and write it into the file.There's no opportunity to restore DB from the ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467789",
        "title": "How to replace a lot of if/elif statements in python?",
        "content": "i am writing function in python for control outputs on QUIDO board throught post html requests. I have a lot of if and elif statements in my program. Is there some way how to make code more ...",
        "vote": "-1",
        "answer": "-1",
        "view": "6"
    },
    {
        "id": "73467751",
        "title": "Tkinter progress bar with integer increment not time",
        "content": "I want to use the Tkinter progress bar as an indicator of the number of iterations in for loop e.g.     for i in range(123)progress bar steps to \"i\" and full bar and stops when reaching &...",
        "vote": "-1",
        "answer": "-1",
        "view": "0"
    },
    {
        "id": "73467706",
        "title": "Social media follower counter program [closed]",
        "content": "I am coding a program to check how many social media followers a user has along with keep track of how many individuals follow that user, unfollow that user and block that user. I would like some ...",
        "vote": "-5",
        "answer": "-5",
        "view": "1"
    },
    {
        "id": "73467655",
        "title": "OperationalError: (psycopg2.OperationalError) terminating connection due to idle-in-transaction timeout",
        "content": "I have a function that perfroms a search likedef search(cls: Type[T], session, search_query):        combined_search_vector = (            x.y.search_vector            | sa.func.coalesce(xClass....",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467630",
        "title": "Multi Camera Multi perosin tracking python",
        "content": "I want to make an application to track people on multiple cameras if one person goes into another camera angle they can not lose his or her ID I don't want to use a re-identification system",
        "vote": "-3",
        "answer": "-3",
        "view": "0"
    },
    {
        "id": "73467626",
        "title": "What is running behind when creating Django project with one line command",
        "content": "a fresh question about Django. It maybe silly...I wonder what is running behind the scene when I create a Django project with one line command. Well, I have done with couples of Django projects, the ...",
        "vote": "2",
        "answer": "2",
        "view": "0"
    },
    {
        "id": "73467618",
        "title": "Not able to fetch titles of a website using BS4",
        "content": "import requestsfrom bs4 import BeautifulSoupurl = \"https://youtube.com/\"r = requests.get(url)htmlContent = r.contentsoup=BeautifulSoup(htmlContent, 'html.parser')title = soup.title()...",
        "vote": "0",
        "answer": "0",
        "view": "2"
    },
    {
        "id": "73467584",
        "title": "Can I pre-transform images when training a deep learning model?",
        "content": "If you ever trained a model, you sometimes can see DataLoader (e.g. I am using pytorch Dataloader) could be the bottleneck because everytime you get an training sample from the dataset, the data ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467581",
        "title": "Python Pandas round decimal using reference rows",
        "content": "I want to round the number in bid_2 and ask_2 depends of the bid_1 and ask_1. If bid_1 has 4 digit after the dot, make the bid_2 with 4 digits after the dot.My df is like this:          symbol   ...",
        "vote": "0",
        "answer": "0",
        "view": "1"
    },
    {
        "id": "73467535",
        "title": "Getting Json object and creating columns for it in Scala?",
        "content": "I need help in converting python code to Scala program in azure databricks environment,FYI, I have below df in scalaval df = spark.read.format(\"delta\").load(\"my-file-path\")     ...",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467534",
        "title": "Excel vlookup in python dataframe",
        "content": "How can i make vlookup like in excel to pandas, i'm totally begginer in python. My first and second dataframe like thisdata_01 = pd.DataFrame({'Tipe Car':['A', 'B', 'C', 'D'], 'Branch':['UD', 'UA', '...",
        "vote": "0",
        "answer": "0",
        "view": "1"
    },
    {
        "id": "73467530",
        "title": "Can you pls tell me where do I give input in this code? [closed]",
        "content": "Where do I give input here to train my dad. Where do I import my datset?def __init__(self, word_features_dim, dense_features_dim):    lstm_input_phrase = keras.layers.Input(shape=(None, ...",
        "vote": "-2",
        "answer": "-2",
        "view": "0"
    },
    {
        "id": "73467526",
        "title": "Print a variable inside a variable [duplicate]",
        "content": "line0 = \"hello\"line1 = \"stack\"line2 = \"overflow\"linenum = 1for x in range(3):    linenum = \"line%d\"%(x)    print(linenum)I would like to print hello ...",
        "vote": "-1",
        "answer": "-1",
        "view": "5"
    },
    {
        "id": "73467521",
        "title": "How to create LSTM model with time series data with joint torque prediction",
        "content": "I'm trying to predict joint torque from 8 input features with an LSTM model.I've tried using TimeseriesGenerator but kept getting an errorKey: 10 when I tried running the .fit_generator function in ...",
        "vote": "1",
        "answer": "1",
        "view": "0"
    },
    {
        "id": "73467520",
        "title": "Obtain List of Losses Per Epoch from FastAI Learner",
        "content": "Is there a FastAI method for obtaining a list of losses during testing/validation?I would like to obtain a list of numerical losses per epoch.from fastai.text.all import *learn = Learner(dls, model....",
        "vote": "0",
        "answer": "0",
        "view": "0"
    },
    {
        "id": "73467511",
        "title": "How to find the 'peak' of a polynomial regression line in Matplotlib",
        "content": "Is it possible to find the peak (vertex?) values (x,y) of a polynomial regression line that was computed using Matplotlib?I've included my basic setup below (of course with fuller data sets), as well ...",
        "vote": "0",
        "answer": "0",
        "view": "1"
    }
]